szymor/rtt_bk7252_sdk/packages/ty_iot_wf_rtos_sdk_1.0.5/platforms/bk7252/tuya_app_common/src/tuya_main.c
/***********************************************************
*  File: tuya_main.c
*  Author: nzy
*  Date: 20171012
***********************************************************/
#include "tuya_os_adapter.h"
#include "tuya_iot_wifi_api.h"
#include "flash_api.h"
#include <device_lock.h>
#include "rtl8710b_ota.h"
#include "mf_test.h"
#include "uni_log.h"
#include "tuya_uart.h"
#include "tuya_gpio.h"
#include "gw_intf.h"
#include "wf_basic_intf.h"
#if TY_SECURITY_CHIP
#include "Z32HUA_encrypt.h"
#endif


/***********************************************************
*************************micro define***********************
***********************************************************/
#define TEST_SSID "tuya_mdev_test1"
#define WF_SSID_LEN 32
/***********************************************************
*************************variable define********************
***********************************************************/

typedef enum {
    UGS_RECV_HEADER = 0,
    UGS_RECV_OTA_HD,
    UGS_SEARCH_SIGN,
    UGS_RECV_SIGN,
    UGS_RECV_IMG_DATA,
    // UGS_RECV_RDP_DATA,
    UGS_FINISH
}UG_STAT_E;

typedef struct {
    UG_STAT_E stat;
    update_ota_target_hdr hdr;
    u32 ota_index;

    u32 image_cnt;
    u8 signature[8];
    update_dw_info DownloadInfo[2];
    u32 cur_image_cnt[2];

    flash_t flash;
    u32 new_addr;
    u32 recv_data_cnt;
}UG_PROC_S;

STATIC UG_PROC_S *ug_proc = NULL;
extern VOID app_init(VOID);
typedef VOID (*APP_PROD_CB)(BOOL_T flag, CHAR_T rssi);//lql
typedef VOID (*after_mf_test_cb)(VOID);
STATIC APP_PROD_CB app_prod_test = NULL;//lql
STATIC GW_WF_CFG_MTHD_SEL gwcm_mode = GWCM_OLD;//lql
STATIC CHAR_T prod_ssid_name[WF_SSID_LEN + 1] = TEST_SSID;
after_mf_test_cb pre_app_cb = NULL;

/***********************************************************
*************************function define********************
***********************************************************/
extern VOID pre_device_init(VOID);
extern OPERATE_RET device_init(VOID);
extern BOOL_T gpio_test(VOID);
extern VOID mf_user_callback(VOID);
extern VOID tuya_cnt_rst_judge(VOID);

extern void sys_jtag_off(void);
extern TY_GPIO_PORT_E swith_ctl_port;
STATIC VOID __gw_ug_inform_cb(INOUT BOOL_T *handled, IN CONST FW_UG_S *fw);
STATIC OPERATE_RET __gw_upgrage_process_cb(IN CONST FW_UG_S *fw, IN CONST UINT total_len,IN CONST UINT offset,\
                                                      IN CONST BYTE_T *data,IN CONST UINT len,OUT UINT *remain_len, IN PVOID pri_data);
STATIC VOID __gw_upgrade_notify_cb(IN CONST FW_UG_S *fw, IN CONST INT_T download_result, IN PVOID pri_data);

STATIC OPERATE_RET __mf_gw_upgrade_notify_cb(VOID);
STATIC VOID __mf_gw_ug_inform_cb(UINT_T file_size, UINT_T file_crc);

STATIC VOID __tuya_mf_uart_init(UINT_T baud,UINT_T bufsz)
{
    ty_uart_init(TY_UART0,baud,TYWL_8B,TYP_NONE,TYS_STOPBIT1,bufsz,TRUE);
}
STATIC VOID __tuya_mf_uart_free(VOID)
{
    ty_uart_free(TY_UART0);
}

STATIC VOID __tuya_mf_send(IN CONST BYTE_T *data,IN CONST UINT len)
{
    ty_uart_send_data(TY_UART0,data,len);
}

STATIC UINT __tuya_mf_recv(OUT BYTE_T *buf,IN CONST UINT len)
{
    return ty_uart_read_data(TY_UART0,buf,len);
}
STATIC BOOL_T scan_test_ssid(VOID)
{
    OPERATE_RET op_ret = OPRT_OK;
    GW_WORK_STAT_MAG_S read_gw_wsm;
    op_ret = wd_gw_wsm_read(&read_gw_wsm);
	if(gwcm_mode == GWCM_OLD_PROD ) {
        if(read_gw_wsm.nc_tp >= GWNS_TY_SMARTCFG) {
            return false;
        }
	} else if (gwcm_mode == GWCM_SPCL_MODE || gwcm_mode == GWCM_LOW_POWER){
        if(read_gw_wsm.nc_tp != GWNS_LOWPOWER) {
            return false;
        }
    }
    
    wf_wk_mode_set(WWM_STATION);
    AP_IF_S *ap = NULL;
    BOOL_T flag = TRUE;
    PR_NOTICE("current product ssid name:%s", prod_ssid_name);
	op_ret = wf_assign_ap_scan(prod_ssid_name, &ap);//lql
    wf_station_disconnect();
    if(OPRT_OK != op_ret) {
        PR_DEBUG("wf_assign_ap_scan failed(%d)",op_ret);
        return FALSE;
    }
    //check if has authorized
    op_ret = wd_gw_base_if_read(&(get_gw_cntl()->gw_base));
    if(OPRT_OK != op_ret) {
        PR_DEBUG("read flash err");
        flag = FALSE;
    }
    // gateway base info verify
    #if TY_SECURITY_CHIP
    if(!get_gw_cntl()->gw_base.has_auth) {
    #else
    if(0 == get_gw_cntl()->gw_base.auth_key[0] || \
       0 == get_gw_cntl()->gw_base.uuid[0]) {
    #endif
        PR_DEBUG("please write uuid and auth_key first");
        flag = FALSE;
    }

    if(app_prod_test) {
        app_prod_test(flag, ap->rssi);
    }
    return TRUE;
}

void app_cfg_set(IN CONST GW_WF_CFG_MTHD_SEL mthd, APP_PROD_CB callback)
{
    app_prod_test = callback;
    gwcm_mode = mthd;
}

#if 0
#include "aes_inf.h"

STATIC CHAR_T s_ecb_enc_key_arr[16] = {0};
STATIC CHAR_T s_ecb_dec_key_arr[16] = {0};
STATIC CHAR_T s_cbc_enc_key_arr[16] = {0};
STATIC CHAR_T s_cbc_dec_key_arr[16] = {0};
STATIC INT_T s_crypto_mode = -1; //ecb_enc:0 ecb_dec:1 cbc_enc:2 cbc_dec:3

STATIC OPERATE_RET AES128_ECB_ENC_BUF_realtek(IN BYTE_T *input, IN CONST BYTE_T *key, OUT BYTE_T *output)
{
    UINT_T input_len = 16;
    UINT_T key_len = 16;
    int ret = 0;

    #ifdef __ICCARM__
    #pragma data_alignment = 4
    #elif defined (__GNUC__)
    __attribute__ ((aligned (4)))
    #endif
    STATIC BYTE_T tmp_key[16] = {0};//入参必须4字节对齐
    if( (s_crypto_mode != 0) || (memcmp(s_ecb_enc_key_arr, key, key_len) != 0) ) {
        memcpy(tmp_key, key, key_len);
        ret = rtl_crypto_aes_ecb_init(tmp_key, key_len);
        if ( ret != 0 ) {
            PR_ERR("AES rtl_crypto_aes_ecb_init failed tmp_key:%s 0x%x key_len:%u ret:%d",
                   tmp_key, (UINT_T)tmp_key, key_len, ret);
            return ret;
        }
        s_crypto_mode = 0;
        memcpy(s_ecb_enc_key_arr, key, key_len);
    }

    ret = rtl_crypto_aes_ecb_encrypt(input, input_len, NULL, 0, output);
    if ( ret != 0 ) {
        PR_ERR("AES rtl_crypto_aes_ecb_encrypt failed input:0x%x inputlen:%u output:0x%x ret:%d",
               (UINT_T)input, input_len, (UINT_T)output, ret);
        return ret;
    }
    return OPRT_OK;
}

STATIC OPERATE_RET AES128_ECB_DEC_BUF_realtek(IN BYTE_T *input,IN CONST BYTE_T *key,OUT BYTE_T *output)
{
    UINT_T input_len = 16;
    UINT_T key_len = 16;
    int ret = 0;

