szymor/rtt_bk7252_sdk/packages/ty_iot_wf_rtos_sdk_1.0.5/platforms/bk7252/tuya_app_common/src/tuya_main.c
    #ifdef __ICCARM__
    #pragma data_alignment = 4
    #elif defined (__GNUC__)
    __attribute__ ((aligned (4)))
    #endif
    STATIC BYTE_T tmp_key[16] = {0};//入参必须4字节对齐
    if( (s_crypto_mode != 1) || (memcmp(s_ecb_dec_key_arr, key, key_len) != 0) ) {
        memcpy(tmp_key, key, key_len);
        ret = rtl_crypto_aes_ecb_init(tmp_key, key_len);
        if ( ret != 0 ) {
            PR_ERR("AES rtl_crypto_aes_ecb_init failed tmp_key:%s 0x%x key_len:%u ret:%d",
                   tmp_key, (UINT_T)tmp_key, key_len, ret);
            return ret;
        }
        s_crypto_mode = 1;
        memcpy(s_ecb_dec_key_arr, key, key_len);
    }

    ret = rtl_crypto_aes_ecb_decrypt(input, input_len, NULL, 0, output);
    if ( ret != 0 ) {
        PR_ERR("AES rtl_crypto_aes_ecb_decrypt failed input:0x%x inputlen:%u output:0x%x ret:%d",
               (UINT_T)input, input_len, (UINT_T)output, ret);
        return ret;
    }
    return OPRT_OK;
}

STATIC OPERATE_RET AES128_CBC_ENC_BUF_realtek(OUT BYTE_T *output,IN BYTE_T *input,IN UINT_T length,
                                              IN CONST BYTE_T *key,IN CONST BYTE_T *iv)
{
    UINT_T key_len = 16;
    UINT_T iv_len = 16;
    int ret = 0;

    #ifdef __ICCARM__
    #pragma data_alignment = 4
    #elif defined (__GNUC__)
    __attribute__ ((aligned (4)))
    #endif
    STATIC BYTE_T tmp_key[16] = {0};//入参必须4字节对齐
    if( (s_crypto_mode != 2) || (memcmp(s_cbc_enc_key_arr, key, key_len) != 0) ) {
        memcpy(tmp_key, key, key_len);
        ret = rtl_crypto_aes_cbc_init(tmp_key, key_len);
        if ( ret != 0 )
        {
            PR_ERR("AES rtl_crypto_aes_cbc_init failed tmp_key:%s 0x%x key_len:%u ret:%d",
                   tmp_key, (UINT_T)tmp_key, key_len, ret);
            return ret;
        }
        s_crypto_mode = 2;
        memcpy(s_cbc_enc_key_arr, key, key_len);
    }

    #ifdef __ICCARM__
    #pragma data_alignment = 4
    #elif defined (__GNUC__)
    __attribute__ ((aligned (4)))
    #endif
    STATIC BYTE_T tmp_iv[16] = {0};//入参必须4字节对齐
    memcpy(tmp_iv, iv, iv_len);
    ret = rtl_crypto_aes_cbc_encrypt(input, length, tmp_iv, iv_len, output);
    if ( ret != 0 ) {
        PR_ERR("AES rtl_crypto_aes_cbc_encrypt failed input:0x%x output:0x%x iv:0x%x ivlen:%u length:%u ret:%d",
               (UINT_T)input, (UINT_T)output, (UINT_T)tmp_iv, iv_len, length, ret);
        return ret;
    }
    return OPRT_OK;
}

STATIC OPERATE_RET AES128_CBC_DEC_BUF_realtek(OUT BYTE_T *output,IN BYTE_T *input,IN UINT_T length,
                                              IN CONST BYTE_T *key,IN CONST BYTE_T *iv)
{
    UINT_T key_len = 16;
    UINT_T iv_len = 16;
    int ret = 0;

    #ifdef __ICCARM__
    #pragma data_alignment = 4
    #elif defined (__GNUC__)
    __attribute__ ((aligned (4)))
    #endif
    STATIC BYTE_T tmp_key[16] = {0};//入参必须4字节对齐
    if( (s_crypto_mode != 3) || (memcmp(s_cbc_dec_key_arr, key, key_len) != 0) ) {
        memcpy(tmp_key, key, key_len);
        ret = rtl_crypto_aes_cbc_init(tmp_key, key_len);
        if ( ret != 0 ) {
            PR_ERR("AES rtl_crypto_aes_cbc_init failed tmp_key:%s 0x%x key_len:%u ret:%d",
                   tmp_key, (UINT_T)tmp_key, key_len, ret);
            return ret;
        }
        s_crypto_mode = 3;
        memcpy(s_cbc_dec_key_arr, key, key_len);
    }

    #ifdef __ICCARM__
    #pragma data_alignment = 4
    #elif defined (__GNUC__)
    __attribute__ ((aligned (4)))
    #endif
    STATIC BYTE_T tmp_iv[16] = {0};//入参必须4字节对齐
    memcpy(tmp_iv, iv, iv_len);
    ret = rtl_crypto_aes_cbc_decrypt(input, length, tmp_iv, iv_len, output);
    if ( ret != 0 ) {
        PR_ERR("AES rtl_crypto_aes_cbc_decrypt failed input:0x%x output:0x%x iv:0x%x ivlen:%u length:%u ret:%d",
               (UINT_T)input, (UINT_T)output, (UINT_T)tmp_iv, iv_len, length, ret);
        return ret;
    }
    return OPRT_OK;
}


#endif

/***********************************************************
*  Function: user_main
*  Input: none
*  Output: none
*  Return: none
***********************************************************/
void user_main(void)
{
    OPERATE_RET op_ret = OPRT_OK;
    
    TY_INIT_PARAMS_S init_param = {0};
    init_param.init_db = FALSE;
    strcpy(init_param.sys_env, "RTL8710BN_2M");
    op_ret = tuya_iot_init_params(NULL, &init_param);
    if(OPRT_OK != op_ret) {
        PR_ERR("tuya_iot_init err:%d",op_ret);
        return;
    }
    sys_jtag_off();//lql

#if TY_SECURITY_CHIP
    SEChip_I2C_Init(); //加密芯片 I2C 接口初始化
//    SE_EncyptDemoTest(); //加密芯片demo
#endif

#if 0
    AES_METHOD_REG_S aes_regs =
    {
        AES128_ECB_ENC_BUF_realtek,
        AES128_ECB_DEC_BUF_realtek,
        AES128_CBC_ENC_BUF_realtek,
        AES128_CBC_DEC_BUF_realtek
    };
    aes_method_register(&aes_regs);
#endif
    pre_device_init();
    tuya_cnt_rst_judge();
    tuya_iot_kv_flash_init(NULL);
	if(pre_app_cb) {
        pre_app_cb();
    }
    extern void wait_wifi_semaphore(void);
    wait_wifi_semaphore();

#if 1
    // to add prodect test code
    mf_reg_gw_ug_cb(__mf_gw_ug_inform_cb, __gw_upgrage_process_cb, __mf_gw_upgrade_notify_cb);
    MF_IMPORT_INTF_S intf = {
        .uart_init = __tuya_mf_uart_init,
        .uart_free = __tuya_mf_uart_free,
        .uart_send = __tuya_mf_send,
        .uart_recv = __tuya_mf_recv,
        .gpio_test = gpio_test,
        .mf_user_product_test = NULL,
        .user_callback = mf_user_callback,
    };
    op_ret = mf_init(&intf,APP_BIN_NAME,USER_SW_VER,TRUE);
    if(OPRT_OK != op_ret) {
        PR_ERR("mf_init err:%d",op_ret);
        return;
    }
    ty_uart_free(TY_UART0);
    PR_NOTICE("mf_init succ");
#endif
    // register gw upgrade inform callback
    iot_register_pre_gw_ug_cb(__gw_ug_inform_cb);

// for debug
#if 0
    WF_GW_PROD_INFO_S wf_prod_info = {
        "tuyad6db61930456075e","eAr5qH46Dw9HcpISLk5GpD4z1q3nvrfp",NULL,NULL
    };
    op_ret = tuya_iot_set_wf_gw_prod_info(&wf_prod_info);
    if(OPRT_OK != op_ret) {
        PR_ERR("tuya_iot_set_wf_gw_prod_info err:%d",op_ret);
        return;
    }
#endif

