szymor/rtt_bk7252_sdk/packages/ty_iot_wf_rtos_sdk_1.0.5/platforms/bk7252/tuya_app_common/src/tuya_main.c
#if 0
    DEBUG_GW_PROD_INFO_S debug_prod_info = {
        TRUE, NULL, NULL
    };
    op_ret = tuya_iot_set_wf_gw_debug_info(&debug_prod_info);
    if(OPRT_OK != op_ret) {
        PR_ERR("tuya_iot_set_wf_gw_prod_info err:%d",op_ret);
        return;
    }
#endif

    app_init();
    PR_DEBUG("gwcm_mode %d",gwcm_mode);
    if(gwcm_mode != GWCM_OLD) {
        PR_DEBUG("low_power select");
        if(true == scan_test_ssid()) {
            PR_DEBUG("prodtest");
            return;
        }
        PR_DEBUG("no tuya_mdev_test1!");
        op_ret = device_init();
        if(OPRT_OK != op_ret) {
            PR_ERR("device_init error:%d",op_ret);
            return;
        }
    }else {
        PR_DEBUG("device_init in");
        op_ret = device_init();
        if(OPRT_OK != op_ret) {
            PR_ERR("device_init err:%d",op_ret);
            return;
        }
    }
}
// mf gateway upgrade start
VOID __mf_gw_ug_inform_cb(UINT_T file_size, UINT_T file_crc)
{
    ug_proc = Malloc(SIZEOF(UG_PROC_S));
    if(NULL == ug_proc) {
        PR_ERR("malloc err");
        return;
    }
    memset(ug_proc,0,SIZEOF(UG_PROC_S));

    if (ota_get_cur_index() == OTA_INDEX_1) {
        ug_proc->ota_index = OTA_INDEX_2;
        PR_DEBUG("OTA2 address space will be upgraded\n");
    } else {
        ug_proc->ota_index = OTA_INDEX_1;
        PR_DEBUG("OTA1 address space will be upgraded\n");
    }
}

// gateway upgrade start
STATIC VOID __gw_ug_inform_cb(INOUT BOOL_T *handled, IN CONST FW_UG_S *fw)
{
    PR_DEBUG("Rev Pre_GW Upgrade Info");
    PR_DEBUG("fw->tp:%d", fw->tp);
    PR_DEBUG("fw->fw_url:%s", fw->fw_url);
    PR_DEBUG("fw->fw_hmac:%s", fw->fw_hmac);
    PR_DEBUG("fw->sw_ver:%s", fw->sw_ver);
    PR_DEBUG("fw->file_size:%d", fw->file_size);

    if(fw->tp != DEV_NM_ATH_SNGL)
    {
        *handled = FALSE;
        return;
    }
    *handled = TRUE;

    ug_proc = Malloc(SIZEOF(UG_PROC_S));
    if(NULL == ug_proc) {
        PR_ERR("malloc err");
        return;
    }
    memset(ug_proc,0,SIZEOF(UG_PROC_S));
    OPERATE_RET op_ret = OPRT_OK;
    op_ret = tuya_iot_upgrade_gw(fw,__gw_upgrage_process_cb,__gw_upgrade_notify_cb,NULL);
    if(OPRT_OK != op_ret) {
        PR_ERR("tuya_iot_upgrade_gw err:%d",op_ret);
        return;
    }

    memset(ug_proc,0,SIZEOF(UG_PROC_S));
    if (ota_get_cur_index() == OTA_INDEX_1) {
        ug_proc->ota_index = OTA_INDEX_2;
        PR_DEBUG("OTA2 address space will be upgraded\n");
    } else {
        ug_proc->ota_index = OTA_INDEX_1;
        PR_DEBUG("OTA1 address space will be upgraded\n");
    }
}
// mf gateway upgrade result notify
OPERATE_RET __mf_gw_upgrade_notify_cb(VOID)
{
    // verify
    u32 ret = 0;
    ret = verify_ota_checksum(ug_proc->new_addr,ug_proc->DownloadInfo[0].ImageLen, \
                              ug_proc->signature,&ug_proc->hdr);
    if(1 != ret) {
        PR_ERR("verify_ota_checksum err");

        device_mutex_lock(RT_DEV_LOCK_FLASH);
        flash_erase_sector(&ug_proc->flash, ug_proc->new_addr - SPI_FLASH_BASE);
        device_mutex_unlock(RT_DEV_LOCK_FLASH);
        return OPRT_COM_ERROR;
    }

    if(!change_ota_signature(ug_proc->new_addr, ug_proc->signature, ug_proc->ota_index)) {
        PR_ERR("change signature failed\n");
        return OPRT_COM_ERROR;
    }

    PR_NOTICE("the gateway upgrade success");
    return OPRT_OK;
}

// gateway upgrade result notify
STATIC VOID __gw_upgrade_notify_cb(IN CONST FW_UG_S *fw, IN CONST INT_T download_result, IN PVOID pri_data)
{
    if(OPRT_OK == download_result) { // update success
        // verify
        u32 ret = 0;
        ret = verify_ota_checksum(ug_proc->new_addr,ug_proc->DownloadInfo[0].ImageLen, \
                                  ug_proc->signature,&ug_proc->hdr);
        if(1 != ret) {
            PR_ERR("verify_ota_checksum err");
            #if 0
            device_mutex_lock(RT_DEV_LOCK_FLASH);
            flash_erase_sector(&ug_proc->flash, ug_proc->new_addr - SPI_FLASH_BASE);
            device_mutex_unlock(RT_DEV_LOCK_FLASH);
            #endif
            return;
        }

        if(!change_ota_signature(ug_proc->new_addr, ug_proc->signature, ug_proc->ota_index)) {
            PR_ERR("change signature failed\n");
            return;
        }

        PR_NOTICE("the gateway upgrade success");
        ota_platform_reset();
        return;
    }else {
        PR_ERR("the gateway upgrade failed");
    }
}

// gateway upgrade process
STATIC OPERATE_RET __gw_upgrage_process_cb(IN CONST FW_UG_S *fw, IN CONST UINT total_len,IN CONST UINT offset,\
                                                      IN CONST BYTE_T *data,IN CONST UINT len,OUT UINT *remain_len, IN PVOID pri_data)
{
    STATIC UINT ota_hd_len = 0;

    switch(ug_proc->stat) {
        case UGS_RECV_HEADER: {
            if(len < SIZEOF(update_file_hdr)) {
                *remain_len = len;
                break;
            }

            memcpy(&ug_proc->hdr.FileHdr,data,SIZEOF(update_file_hdr));
            ug_proc->stat = UGS_RECV_OTA_HD;
            ota_hd_len = (ug_proc->hdr.FileHdr.HdrNum) * SIZEOF(update_file_img_hdr);
            *remain_len = len;

            PR_DEBUG("ota_hd_len:%d",ota_hd_len);
        }
        //break;

        case UGS_RECV_OTA_HD: {
            if(len < ota_hd_len+SIZEOF(update_file_hdr)) {
                *remain_len = len;
                break;
            }

            char * pImgId = NULL;
            if(OTA_INDEX_1 == ug_proc->ota_index) {
                pImgId = "OTA1";
            }else {
                pImgId = "OTA2";
            }

            u32 ret = 0;
            ret = get_ota_tartget_header(data,(ota_hd_len+SIZEOF(update_file_hdr)), \
                                         &(ug_proc->hdr), pImgId);
            if(0 == ret) {
                PR_ERR("get_ota_tartget_header err");
                return OPRT_COM_ERROR;
            }

            // get new image addr and check new address validity
            if(!get_ota_address(ug_proc->ota_index, &ug_proc->new_addr, &(ug_proc->hdr))) {
                PR_ERR("get_ota_address err");
                return OPRT_COM_ERROR;
            }

