szymor/rtt_bk7252_sdk/packages/ty_iot_wf_rtos_sdk_1.0.5/platforms/bk7252/tuya_app_common/src/tuya_main.c
            u32 new_img_len = ug_proc->hdr.FileImgHdr.ImgLen;

            PR_NOTICE("ug_proc->new_addr:0x%x",ug_proc->new_addr);
            PR_NOTICE("new_img_len:%d",new_img_len);
            
            #if OPERATING_SYSTEM == SYSTEM_REALTEK8710_1M
            if(new_img_len > (468*1024 -32)) {//32 Bytes resvd for header 468K
                PR_ERR("image length is too big");
                return OPRT_COM_ERROR;
            }
            #endif

            #if OPERATING_SYSTEM == SYSTEM_REALTEK8710_2M
            if(new_img_len > (788*1024 - 32)) {//32 Bytes resvd for header 960K
                PR_ERR("image length is too big");
                return OPRT_COM_ERROR;
            }
            #endif
            
            erase_ota_target_flash(ug_proc->new_addr, new_img_len);
            if(ug_proc->hdr.RdpStatus == ENABLE) {
                device_mutex_lock(RT_DEV_LOCK_FLASH);
                flash_erase_sector(&ug_proc->flash, RDP_FLASH_ADDR - SPI_FLASH_BASE);
                device_mutex_unlock(RT_DEV_LOCK_FLASH);
            }

            // 暂时仅支持image的升级
            if(ug_proc->hdr.RdpStatus == ENABLE) {
                ug_proc->image_cnt = 2;
                if(ug_proc->hdr.FileImgHdr.Offset < ug_proc->hdr.FileRdpHdr.Offset) {
                    ug_proc->DownloadInfo[0].ImgId = OTA_IMAG;
                    /* get OTA image and Write New Image to flash, skip the signature,
                    not write signature first for power down protection*/
                    ug_proc->DownloadInfo[0].FlashAddr = ug_proc->new_addr -SPI_FLASH_BASE + 8;
                    ug_proc->DownloadInfo[0].ImageLen = ug_proc->hdr.FileImgHdr.ImgLen - 8;/*skip the signature*/
                    ug_proc->DownloadInfo[0].ImgOffset = ug_proc->hdr.FileImgHdr.Offset;
                    #if 0
                    ug_proc->DownloadInfo[1].ImgId = RDP_IMAG;
                    ug_proc->DownloadInfo[1].FlashAddr = RDP_FLASH_ADDR - SPI_FLASH_BASE;
                    ug_proc->DownloadInfo[1].ImageLen = ug_proc->hdr.FileRdpHdr.ImgLen;
                    ug_proc->DownloadInfo[1].ImgOffset = ug_proc->hdr.FileRdpHdr.Offset;
                    #endif
                } else {
                    #if 0
                    ug_proc->DownloadInfo[0].ImgId = RDP_IMAG;
                    ug_proc->DownloadInfo[0].FlashAddr = RDP_FLASH_ADDR - SPI_FLASH_BASE;
                    ug_proc->DownloadInfo[0].ImageLen = ug_proc->hdr.FileRdpHdr.ImgLen;
                    ug_proc->DownloadInfo[0].ImgOffset = ug_proc->hdr.FileRdpHdr.Offset;
                    ug_proc->DownloadInfo[1].ImgId = OTA_IMAG;
                    /* get OTA image and Write New Image to flash, skip the signature,
                    not write signature first for power down protection*/
                    ug_proc->DownloadInfo[1].FlashAddr = ug_proc->new_addr -SPI_FLASH_BASE + 8;
                    ug_proc->DownloadInfo[1].ImageLen = ug_proc->hdr.FileImgHdr.ImgLen - 8;/*skip the signature*/
                    ug_proc->DownloadInfo[1].ImgOffset = ug_proc->hdr.FileImgHdr.Offset;
                    #else
                    ug_proc->DownloadInfo[0].ImgId = OTA_IMAG;
                    /* get OTA image and Write New Image to flash, skip the signature,
                    not write signature first for power down protection*/
                    ug_proc->DownloadInfo[0].FlashAddr = ug_proc->new_addr -SPI_FLASH_BASE + 8;
                    ug_proc->DownloadInfo[0].ImageLen = ug_proc->hdr.FileImgHdr.ImgLen - 8;/*skip the signature*/
                    ug_proc->DownloadInfo[0].ImgOffset = ug_proc->hdr.FileImgHdr.Offset;
                    #endif
                }
            }else {
                ug_proc->image_cnt = 1;
                ug_proc->DownloadInfo[0].ImgId = OTA_IMAG;
                /* get OTA image and Write New Image to flash, skip the signature,
                not write signature first for power down protection*/
                ug_proc->DownloadInfo[0].FlashAddr = ug_proc->new_addr -SPI_FLASH_BASE + 8;
                ug_proc->DownloadInfo[0].ImageLen = ug_proc->hdr.FileImgHdr.ImgLen - 8;/*skip the signature*/
                ug_proc->DownloadInfo[0].ImgOffset = ug_proc->hdr.FileImgHdr.Offset;
            }
            PR_NOTICE("FlashAddr = 0x%x", ug_proc->DownloadInfo[0].FlashAddr);
            PR_NOTICE("ImageLen = %d", ug_proc->DownloadInfo[0].ImageLen);
            PR_NOTICE("ImgOffset = %d", ug_proc->DownloadInfo[0].ImgOffset);
            PR_NOTICE("OTA Image Address = 0x%x", ug_proc->new_addr);
            if(ug_proc->hdr.RdpStatus == ENABLE) {
                PR_NOTICE("RDP Image Address = %x", RDP_FLASH_ADDR);
            }

            ug_proc->recv_data_cnt = ota_hd_len + sizeof(update_file_hdr); // (ug_proc->hdr.FileHdr.HdrNum * ug_proc->hdr.FileImgHdr.ImgHdrLen)
            *remain_len = len - (ota_hd_len+SIZEOF(update_file_hdr));
            ug_proc->stat = UGS_SEARCH_SIGN;
        }
        break;

        case UGS_SEARCH_SIGN: {
            if(ug_proc->recv_data_cnt + len < ug_proc->DownloadInfo[0].ImgOffset) {
                ug_proc->recv_data_cnt += len;
                *remain_len = 0;
                break;
            }
            PR_NOTICE("ug_proc->recv_data_cnt:%d",ug_proc->recv_data_cnt);
            PR_NOTICE("len:%d",len);

            INT_T offset = (ug_proc->DownloadInfo[0].ImgOffset - ug_proc->recv_data_cnt);
            *remain_len = len - offset;
            if(*remain_len < SIZEOF(ug_proc->signature)) {
                ug_proc->recv_data_cnt += offset;
                ug_proc->stat = UGS_RECV_SIGN;
            }else {
                mempcpy(ug_proc->signature,data+offset,SIZEOF(ug_proc->signature));
                *remain_len -= SIZEOF(ug_proc->signature);
                ug_proc->stat = UGS_RECV_IMG_DATA;
            }
        }
        break;

        case UGS_RECV_SIGN: {
            if(len < SIZEOF(ug_proc->signature)) { // 8 is signature
                *remain_len = len;
                break;
            }

            mempcpy(ug_proc->signature,data,SIZEOF(ug_proc->signature));

