szymor/rtt_bk7252_sdk/packages/ty_iot_wf_rtos_sdk_1.0.5/platforms/bk7252/tuya_app_common/src/tuya_main.c
            #if 0
            INT_T i = 0;
            PR_DEBUG_RAW("ug_proc->signature:");
            for(i = 0;i < SIZEOF(ug_proc->signature);i++) {
                PR_DEBUG_RAW("%02x",ug_proc->signature[i]);
            }
            PR_DEBUG_RAW("\n");
            #endif

            ug_proc->recv_data_cnt += 8;
            *remain_len = len-8;
            ug_proc->stat = UGS_RECV_IMG_DATA;
        }
        break;

        case UGS_RECV_IMG_DATA: {
            #define RT_IMG_WR_UNIT 1024
            if(ug_proc->cur_image_cnt[0] >= ug_proc->DownloadInfo[0].ImageLen) {
                ug_proc->stat = UGS_FINISH;
                *remain_len = len;
                break;
            }

            if((ug_proc->cur_image_cnt[0] + len < ug_proc->DownloadInfo[0].ImageLen) && \
               (len < RT_IMG_WR_UNIT)) {
                *remain_len = len;
                break;
            }

            u32 write_len = 0;
            if(ug_proc->cur_image_cnt[0] + len < ug_proc->DownloadInfo[0].ImageLen) {
                write_len = RT_IMG_WR_UNIT;
            }else {
                write_len = (ug_proc->DownloadInfo[0].ImageLen - ug_proc->cur_image_cnt[0]);
            }
            device_mutex_lock(RT_DEV_LOCK_FLASH);
            #if 0
            {
                PR_DEBUG_RAW("wirite data:");
                INT_T i = 0;
                for(i = 0;i < 16;i++) {
                    PR_DEBUG_RAW("%02x ",data[i]);
                }
                PR_DEBUG_RAW("\n");
            }
            #endif
            if(flash_stream_write(&ug_proc->flash, ug_proc->DownloadInfo[0].FlashAddr + ug_proc->cur_image_cnt[0], \
                                  write_len, data) < 0) {
                device_mutex_unlock(RT_DEV_LOCK_FLASH);
                PR_ERR("[%s] Write sector failed");
                return OPRT_WR_FLASH_ERROR;
            }
            device_mutex_unlock(RT_DEV_LOCK_FLASH);
            ug_proc->cur_image_cnt[0] += write_len;
            ug_proc->recv_data_cnt += write_len;
            *remain_len = len - write_len;

            if(ug_proc->cur_image_cnt[0] >= ug_proc->DownloadInfo[0].ImageLen) {
                ug_proc->stat = UGS_FINISH;
                break;
            }
        }
        break;

        case UGS_FINISH: {
            *remain_len = 0;
        }
        break;
    }
    return OPRT_OK;
}


void set_prod_ssid(CHAR_T *ssid)
{
    if (strlen(ssid) > WF_SSID_LEN) {
        PR_ERR("ssid len over max value 32");
        return;
    }
    memset(prod_ssid_name, 0, sizeof(prod_ssid_name));
    strncpy(prod_ssid_name, ssid, WF_SSID_LEN);
    return;
}


void pre_app_cfg_set(after_mf_test_cb callback)
{
    pre_app_cb = callback;
}






